app/controllers/crawlers_controller.rb

INSERT INTO `crawlers` (`configuration`, `created_at`, `updated_at`, `user_id`) VALUES ('---\n:links:\n- :link: http://www2.sabesp.com.br/mananciais/DivulgacaoSiteSabesp.aspx\n :selectors:\n - :selector: .guardaImgBgDetalhe\n :attr_name: index_cantareira_water\n :method: :at_css\n :send_emails:\n - :email: your-email@your-domain.com\n :at: 12pm\n :every: 1.day\n', '2015-04-02 16:49:38', '2015-04-02 16:49:38', 1)
SELECT `crawlers`.* FROM `crawlers` WHERE `crawlers`.`user_id` = 1 ORDER BY `crawlers`.`id` ASC LIMIT 1
---
  def show
    @crawler = Crawler.find_or_create_by_user_id(user_id:current_user.id)

SELECT `crawlers`.* FROM `crawlers` WHERE `crawlers`.`user_id` = 1 LIMIT 1
---
  def edit
    @crawler = Crawler.find_by_user_id current_user.id

SELECT `crawlers`.* FROM `crawlers` WHERE `crawlers`.`user_id` = 1 LIMIT 1
UPDATE `crawlers` SET `configuration` = '--- \'{:links=>[{:link=>\"http://www2.sabesp.com.br/mananciais/DivulgacaoSiteSabesp.aspxxxxxx\",\n :selectors=>[{:selector=>\".guardaImgBgDetalhe\", :attr_name=>\"index_cantareira_water\",\n :method=>:at_css}], :send_emails=>[{:email=>\"your-email@your-domain.com\", :at=>\"12pm\",\n :every=>\"1.day\"}]}]}\'\n', `updated_at` = '2015-04-02 20:40:35' WHERE `crawlers`.`id` = 2
---
  def update
    erro_msg = ""
    @crawler = Crawler.find_by_user_id current_user.id

=begin
    begin
      YAML.load(params[:crawler][:configuration]).try(:with_indifferent_access)
    rescue => e
      if e.is_a? Psych::SyntaxError
        erro_msg = "Error when parametrize in json. Error message:#{e.message}"
      else
        erro_msg = "Unknow error. Check parametrize configuration"
      end
      flash[:alert]= erro_msg
    end
=end

    respond_to do |format|
      if !erro_msg.present? and @crawler.update_attributes(_params)