app/controllers/reserves_controller.rb

SELECT `reserves`.* FROM `reserves`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def feed
  	#Reserve.where(["date between ?, ?", Time.at params[:start], Time.at params[:end]])
  	render :json=>Reserve.all.map{|i| {title:"#{i.date.hour}h #{i.user.email}", start:i.date, end:(i.date+1.hour)}}